
[
  {
    "id": "1",
    "doa": "Doa Sebelum Makan",
    "ayat": "اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ",
    "latin": "Allahumma barik lana فيما razaktana waqina 'adhaban-nar.",
    "artinya": "Ya Allah, berkahilah kami dalam rezeki yang telah Engkau berikan kepada kami dan peliharalah kami dari siksa api neraka.",
    "kategori": "Makanan dan Minuman"
  },
  {
    "id": "2",
    "doa": "Doa Sesudah Makan",
    "ayat": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
    "latin": "Alhamdulillahilladzi ath'amana wa saqana wa ja'alana minal muslimin.",
    "artinya": "Segala puji bagi Allah yang telah memberi kami makan dan minum, serta menjadikan kami seorang muslim.",
    "kategori": "Makanan dan Minuman"
  },
  {
    "id": "3",
    "doa": "Doa Sebelum Tidur",
    "ayat": "بِاسْمِكَ اللَّهُمَّ أَحْيَا وَبِاسْمِكَ أَمُوتُ",
    "latin": "Bismika Allahumma ahya wa bismika amut.",
    "artinya": "Dengan nama-Mu, ya Allah, aku hidup dan dengan nama-Mu aku mati.",
    "kategori": "Istirahat"
  },
  {
    "id": "4",
    "doa": "Doa Bangun Tidur",
    "ayat": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "latin": "Alhamdulillahilladzi ahyana ba'da ma amatana wa ilaihin nusyur.",
    "artinya": "Segala puji bagi Allah yang telah menghidupkan kami setelah mematikan kami, dan kepada-Nya lah kami akan kembali.",
    "kategori": "Istirahat"
  },
  {
    "id": "5",
    "doa": "Doa Masuk Kamar Mandi",
    "ayat": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
    "latin": "Allahumma inni a'udzu bika minal khubutsi wal khabaitsi.",
    "artinya": "Ya Allah, aku berlindung kepada-Mu dari godaan setan laki-laki dan perempuan.",
    "kategori": "Kebersihan"
  },
  {
    "id": "6",
    "doa": "Doa Keluar Kamar Mandi",
    "ayat": "غُفْرَانَكَ الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنِّي الْأَذَى وَعَافَانِي",
    "latin": "Ghufronaka. Alhamdulillahilladzi adzhaba 'annil adza wa 'afani.",
    "artinya": "Dengan mengharap ampunan-Mu, segala puji bagi Allah yang telah menghilangkan penyakit dari tubuhku dan telah menyehatkan aku.",
    "kategori": "Kebersihan"
  },
  {
    "id": "7",
    "doa": "Doa Ketika Bercermin",
    "ayat": "اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "latin": "Allahumma kama hassanta khalqi, fahassin khuluqi.",
    "artinya": "Ya Allah, sebagaimana Engkau telah memperindah rupaku, maka perindahlah pula akhlakku.",
    "kategori": "Aktivitas Sehari-hari"
  },
  {
    "id": "8",
    "doa": "Doa Keluar Rumah",
    "ayat": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "latin": "Bismillahi, tawakkaltu 'alallah, la haula wa la quwwata illa billah.",
    "artinya": "Dengan nama Allah, aku bertawakal kepada Allah. Tiada daya dan kekuatan kecuali dengan Allah.",
    "kategori": "Perjalanan"
  },
  {
    "id": "9",
    "doa": "Doa Masuk Rumah",
    "ayat": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا",
    "latin": "Bismillahi walajna, wa bismillahi kharajna, wa 'ala rabbina tawakkalna.",
    "artinya": "Dengan nama Allah kami masuk, dengan nama Allah kami keluar, dan hanya kepada Tuhan kami, kami bertawakal.",
    "kategori": "Perjalanan"
  },
  {
    "id": "10",
    "doa": "Doa Naik Kendaraan",
    "ayat": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
    "latin": "Subhanalladzi sakhkhara lana hadza wa ma kunna lahu muqrinin, wa inna ila rabbina lamunqalibun.",
    "artinya": "Maha Suci Tuhan yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami.",
    "kategori": "Perjalanan"
  },
  {
    "id": "11",
    "doa": "Doa Ketika Belajar",
    "ayat": "رَبِّ زِدْنِي عِلْمًا وَارْزُقْنِي فَهْمًا",
    "latin": "Rabbi zidni 'ilman warzuqni fahman.",
    "artinya": "Ya Tuhanku, tambahkanlah aku ilmu dan berikanlah aku pemahaman yang baik.",
    "kategori": "Ilmu dan Pengetahuan"
  },
  {
    "id": "12",
    "doa": "Doa Setelah Belajar",
    "ayat": "اللَّهُمَّ إِنِّي أَسْتَوْدِعُكَ مَا عَلَّمْتَنِيهِ، فَارْدُدْهُ إِلَيَّ عِنْدَ حَاجَتِي إِلَيْهِ، وَلَا تُنْسِنِيهِ يَا رَبَّ الْعَالَمِينَ",
    "latin": "Allahumma inni astaudi'uka ma 'allamtanihi, fardud-hu ilayya 'inda hajati ilaihi, wa la tansanihi ya rabbal 'alamin.",
    "artinya": "Ya Allah, sesungguhnya aku titipkan kepada-Mu apa yang telah Engkau ajarkan kepadaku, maka kembalikanlah ia kepadaku ketika aku membutuhkannya. Dan janganlah Engkau buat aku lupa padanya, wahai Tuhan semesta alam.",
    "kategori": "Ilmu dan Pengetahuan"
  },
  {
    "id": "13",
    "doa": "Doa untuk Kedua Orang Tua",
    "ayat": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
    "latin": "Rabbighfirli wa liwalidayya warhamhuma kama rabbayani shaghira.",
    "artinya": "Ya Tuhanku, ampunilah aku dan kedua orang tuaku, dan sayangilah mereka sebagaimana mereka menyayangiku di waktu kecil.",
    "kategori": "Keluarga"
  },
  {
    "id": "14",
    "doa": "Doa Mohon Kebaikan Dunia Akhirat",
    "ayat": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "latin": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan waqina 'adhaban-nar.",
    "artinya": "Ya Tuhan kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, dan peliharalah kami dari siksa api neraka.",
    "kategori": "Permohonan"
  },
  {
    "id": "15",
    "doa": "Doa Ketika Turun Hujan",
    "ayat": "اللَّهُمَّ صَيِّبًا نَافِعًا",
    "latin": "Allahumma shayyiban nafi'an.",
    "artinya": "Ya Allah, turunkanlah pada kami hujan yang bermanfaat.",
    "kategori": "Alam"
  },
  {
    "id": "16",
    "doa": "Doa Ketika Mendengar Petir",
    "ayat": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
    "latin": "Subhanalladzi yusabbihur ra'du bihamdihi wal malaikatu min khifatihi.",
    "artinya": "Maha Suci Allah yang petir dan para malaikat bertasbih dengan memuji-Nya karena rasa takut kepada-Nya.",
    "kategori": "Alam"
  },
  {
    "id": "17",
    "doa": "Doa Ketika Pagi Hari",
    "ayat": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "latin": "Asbahna wa asbahal mulku lillah, walhamdulillah, la ilaha illallah wahdahu la syarika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai'in qadir.",
    "artinya": "Kami telah memasuki waktu pagi dan kerajaan hanya milik Allah, segala puji bagi Allah. Tidak ada Tuhan (yang berhak disembah) kecuali Allah semata, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia-lah Yang Mahakuasa atas segala sesuatu.",
    "kategori": "Waktu"
  },
  {
    "id": "18",
    "doa": "Doa Ketika Sore Hari",
    "ayat": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "latin": "Amsayna wa amsal mulku lillah, walhamdulillah, la ilaha illallah wahdahu la syarika lah, lahul mulku wa lahul hamdu wa huwa 'ala kulli syai'in qadir.",
    "artinya": "Kami telah memasuki waktu sore dan kerajaan hanya milik Allah, segala puji bagi Allah. Tidak ada Tuhan (yang berhak disembah) kecuali Allah semata, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia-lah Yang Mahakuasa atas segala sesuatu.",
    "kategori": "Waktu"
  },
  {
    "id": "19",
    "doa": "Doa Memohon Ampunan",
    "ayat": "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
    "latin": "Rabbana zalamna anfusana wa in lam taghfirlana wa tarhamna lanakunanna minal khasirin.",
    "artinya": "Ya Tuhan kami, kami telah menzalimi diri kami sendiri, dan jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya pastilah kami termasuk orang-orang yang merugi.",
    "kategori": "Permohonan"
  },
  {
    "id": "20",
    "doa": "Doa Ketika Berpakaian",
    "ayat": "الْحَمْدُ لِلَّهِ الَّذِي كَسَانِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
    "latin": "Alhamdulillahilladzi kasani hadza wa razaqanihi min ghairi hawlin minni wa la quwwatin.",
    "artinya": "Segala puji bagi Allah yang telah memberiku pakaian ini dan merezekikannya kepadaku tanpa daya dan kekuatan dariku.",
    "kategori": "Aktivitas Sehari-hari"
  },
  {
    "id": "21",
    "doa": "Doa Melepas Pakaian",
    "ayat": "بِسْمِ اللَّهِ",
    "latin": "Bismillah.",
    "artinya": "Dengan nama Allah.",
    "kategori": "Aktivitas Sehari-hari"
  },
  {
    "id": "22",
    "doa": "Doa Menjenguk Orang Sakit",
    "ayat": "لَا بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ",
    "latin": "La ba'sa, tahurun in sha Allah.",
    "artinya": "Tidak mengapa, semoga sakitmu ini membersihkanmu dari dosa-dosa, insya Allah.",
    "kategori": "Kesehatan"
  },
  {
    "id": "23",
    "doa": "Doa Ketika Sakit",
    "ayat": "اللَّهُمَّ رَبَّ النَّاسِ أَذْهِبِ الْبَأْسَ، اشْفِهِ وَأَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا",
    "latin": "Allahumma rabban-nas, adzhibil-ba's, isyfihi wa antasy-syafi, la syifa'a illa syifa'uka, syifa'an la yughadiru saqaman.",
    "artinya": "Ya Allah, Tuhan manusia, hilangkanlah penyakit ini, sembuhkanlah, Engkaulah yang Maha Penyembuh, tidak ada kesembuhan kecuali kesembuhan dari-Mu, kesembuhan yang tidak meninggalkan penyakit.",
    "kategori": "Kesehatan"
  },
  {
    "id": "24",
    "doa": "Doa Masuk Masjid",
    "ayat": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
    "latin": "Allahummaftahli abwaba rahmatik.",
    "artinya": "Ya Allah, bukakanlah untukku pintu-pintu rahmat-Mu.",
    "kategori": "Ibadah"
  },
  {
    "id": "25",
    "doa": "Doa Keluar Masjid",
    "ayat": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
    "latin": "Allahumma inni as'aluka min fadhlika.",
    "artinya": "Ya Allah, aku memohon kepada-Mu sebagian dari karunia-Mu.",
    "kategori": "Ibadah"
  },
  {
    "id": "26",
    "doa": "Doa Sebelum Wudhu",
    "ayat": "بِسْمِ اللَّهِ",
    "latin": "Bismillah.",
    "artinya": "Dengan nama Allah.",
    "kategori": "Ibadah"
  },
  {
    "id": "27",
    "doa": "Doa Setelah Wudhu",
    "ayat": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ. اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
    "latin": "Asyhadu an la ilaha illallah wahdahu la syarika lah, wa asyhadu anna Muhammadan 'abduhu wa rasuluh. Allahummaj'alni minat-tawwabina waj'alni minal-mutathahhirin.",
    "artinya": "Aku bersaksi bahwa tidak ada Tuhan selain Allah semata, tidak ada sekutu bagi-Nya. Dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya. Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang yang suci.",
    "kategori": "Ibadah"
  },
  {
    "id": "28",
    "doa": "Doa Iftitah (Sholat)",
    "ayat": "اللَّهُ أَكْبَرُ كَبِيرًا، وَالْحَمْدُ لِلَّهِ كَثِيرًا، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا. وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا مُسْلِمًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ. إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لَا شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ.",
    "latin": "Allahu akbar kabira, walhamdulillahi kathira, wa subhanallahi bukratan wa ashila. Wajjahtu wajhiya lilladzi fatharas-samawati wal-ardha hanifan musliman wa ma ana minal-musyrikin. Inna shalati wa nusuki wa mahyaya wa mamati lillahi rabbil-'alamin, la syarika lahu wa bidzalika umirtu wa ana minal-muslimin.",
    "artinya": "Allah Maha Besar dengan sebesar-besarnya, segala puji bagi Allah dengan pujian yang banyak, dan Maha Suci Allah di waktu pagi dan petang. Kuhadapkan wajahku kepada Zat yang menciptakan langit dan bumi dalam keadaan lurus dan pasrah, dan aku bukanlah dari golongan orang-orang musyrik. Sesungguhnya shalatku, ibadahku, hidupku dan matiku hanyalah untuk Allah, Tuhan semesta alam. Tiada sekutu bagi-Nya, dan demikianlah aku diperintahkan dan aku termasuk golongan orang-orang muslim.",
    "kategori": "Sholat"
  },
  {
    "id": "29",
    "doa": "Doa Ruku' (Sholat)",
    "ayat": "سُبْحَانَ رَبِّيَ الْعَظِيمِ وَبِحَمْدِهِ",
    "latin": "Subhana rabbiyal 'azhimi wa bihamdih.",
    "artinya": "Maha Suci Tuhanku Yang Maha Agung dan dengan memuji-Nya.",
    "kategori": "Sholat"
  },
  {
    "id": "30",
    "doa": "Doa I'tidal (Sholat)",
    "ayat": "رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ",
    "latin": "Rabbana lakal hamdu mil'as-samawati wa mil'al-ardhi wa mil'a ma syi'ta min syai'in ba'du.",
    "artinya": "Ya Tuhan kami, bagi-Mu segala puji, sepenuh langit dan sepenuh bumi, dan sepenuh apa yang Engkau kehendaki setelah itu.",
    "kategori": "Sholat"
  },
  {
    "id": "31",
    "doa": "Doa Sujud (Sholat)",
    "ayat": "سُبْحَانَ رَبِّيَ الْأَعْلَى وَبِحَمْدِهِ",
    "latin": "Subhana rabbiyal a'la wa bihamdih.",
    "artinya": "Maha Suci Tuhanku Yang Maha Tinggi dan dengan memuji-Nya.",
    "kategori": "Sholat"
  },
  {
    "id": "32",
    "doa": "Doa Duduk di Antara Dua Sujud",
    "ayat": "رَبِّ اغْفِرْ لِي وَارْحَمْنِي وَاجْبُرْنِي وَارْفَعْنِي وَارْزُقْنِي وَاهْدِنِي وَعَافِنِي وَاعْفُ عَنِّي",
    "latin": "Rabbighfirli warhamni wajburni warfa'ni warzuqni wahdini wa 'afini wa'fu 'anni.",
    "artinya": "Ya Tuhanku, ampunilah aku, rahmatilah aku, cukupkanlah aku, angkatlah derajatku, berilah aku rezeki, berilah aku petunjuk, sehatkanlah aku, dan maafkanlah aku.",
    "kategori": "Sholat"
  },
  {
    "id": "33",
    "doa": "Doa Tasyahud Akhir (Sholat)",
    "ayat": "التَّحِيَّاتُ الْمُبَارَكَاتُ الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ. اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    "latin": "At-tahiyyatul mubarakatush-shalawatut-thayyibatu lillah. As-salamu 'alaika ayyuhan-nabiyyu wa rahmatullahi wa barakatuh. As-salamu 'alaina wa 'ala 'ibadillahis-shalihin. Asyhadu an la ilaha illallah, wa asyhadu anna Muhammadan rasulullah. Allahumma shalli 'ala Muhammad wa 'ala ali Muhammad, kama shallaita 'ala Ibrahim wa 'ala ali Ibrahim. Wa barik 'ala Muhammad wa 'ala ali Muhammad, kama barakta 'ala Ibrahim wa 'ala ali Ibrahim, fil 'alamina innaka hamidun majid.",
    "artinya": "Segala kehormatan, keberkahan, rahmat, dan kebaikan adalah milik Allah. Semoga keselamatan, rahmat Allah, dan berkah-Nya tercurah kepadamu, wahai Nabi. Semoga keselamatan tercurah kepada kami dan kepada hamba-hamba Allah yang saleh. Aku bersaksi bahwa tiada Tuhan selain Allah dan aku bersaksi bahwa Muhammad adalah utusan Allah. Ya Allah, limpahkanlah rahmat kepada Muhammad dan keluarga Muhammad, sebagaimana Engkau telah melimpahkan rahmat kepada Ibrahim dan keluarga Ibrahim. Dan berkahilah Muhammad dan keluarga Muhammad, sebagaimana Engkau telah memberkahi Ibrahim dan keluarga Ibrahim. Di seluruh alam, sesungguhnya Engkau Maha Terpuji lagi Maha Mulia.",
    "kategori": "Sholat"
  },
  {
    "id": "34",
    "doa": "Doa Setelah Sholat Fardhu",
    "ayat": "أَسْتَغْفِرُ اللَّهَ (3x). اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، تَبَارَكْتَ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ",
    "latin": "Astaghfirullah (3x). Allahumma antas-salam wa minkas-salam, tabarakta ya dzal-jalali wal-ikram.",
    "artinya": "Aku memohon ampun kepada Allah (3x). Ya Allah, Engkaulah As-Salam (Yang Maha Damai), dan dari-Mulah kedamaian. Maha Suci Engkau, wahai Tuhan Yang Pemilik Keagungan dan Kemuliaan.",
    "kategori": "Dzikir dan Wirid"
  },
  {
    "id": "35",
    "doa": "Ayat Kursi",
    "ayat": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "latin": "Allahu la ilaha illa huwal-hayyul-qayyum, la ta'khudzuhu sinatun wa la naum, lahu ma fis-samawati wa ma fil-ardh, man dzalladzi yasyfa'u 'indahu illa bi'idznih, ya'lamu ma baina aidihim wa ma khalfahum, wa la yuhithuna bisyai'im min 'ilmihi illa bima sya', wasi'a kursiyyuhus-samawati wal-ardh, wa la ya'uduhu hifzhuhuma, wa huwal-'aliyyul-'azhim.",
    "artinya": "Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia Yang Hidup kekal lagi terus menerus mengurus (makhluk-Nya); tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa'at di sisi Allah tanpa izin-Nya. Allah mengetahui apa-apa yang di hadapan mereka dan di belakang mereka, dan mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dan Allah tidak merasa berat memelihara keduanya, dan Allah Maha Tinggi lagi Maha Besar.",
    "kategori": "Dzikir dan Wirid"
  },
  {
    "id": "36",
    "doa": "Doa Memohon Ketenangan Hati",
    "ayat": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
    "latin": "Rabbisyrah li shadri, wa yassir li amri, wahlul 'uqdatan min lisani, yafqahu qauli.",
    "artinya": "Ya Tuhanku, lapangkanlah untukku dadaku, dan mudahkanlah untukku urusanku, dan lepaskanlah kekakuan dari lidahku, supaya mereka mengerti perkataanku.",
    "kategori": "Permohonan"
  },
  {
    "id": "37",
    "doa": "Doa Ketika Susah",
    "ayat": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "latin": "La ilaha illa anta subhanaka inni kuntu minaz-zhalimin.",
    "artinya": "Tidak ada Tuhan selain Engkau, Maha Suci Engkau, sesungguhnya aku termasuk orang-orang yang zalim.",
    "kategori": "Kesusahan"
  },
  {
    "id": "38",
    "doa": "Doa Ketika Marah",
    "ayat": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "latin": "A'udzu billahi minasy-syaithanir-rajim.",
    "artinya": "Aku berlindung kepada Allah dari godaan setan yang terkutuk.",
    "kategori": "Kesusahan"
  },
  {
    "id": "39",
    "doa": "Doa Masuk Pasar",
    "ayat": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "latin": "La ilaha illallah wahdahu la syarika lah, lahul mulku wa lahul hamdu, yuhyi wa yumitu wa huwa hayyun la yamut, biyadikal-khair, wa huwa 'ala kulli syai'in qadir.",
    "artinya": "Tidak ada Tuhan selain Allah semata, tidak ada sekutu bagi-Nya. Milik-Nya kerajaan dan pujian. Dia yang menghidupkan dan mematikan, dan Dia hidup tidak akan mati. Di tangan-Nya segala kebaikan dan Dia Maha Kuasa atas segala sesuatu.",
    "kategori": "Aktivitas Sehari-hari"
  },
  {
    "id": "40",
    "doa": "Doa Ketika Bersin",
    "ayat": "(Yang bersin): الْحَمْدُ لِلَّهِ. (Yang mendengar): يَرْحَمُكَ اللَّهُ. (Yang bersin membalas): يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ.",
    "latin": "(Yang bersin): Alhamdulillah. (Yang mendengar): Yarhamukallah. (Yang bersin membalas): Yahdikumullahu wa yushlihu balakum.",
    "artinya": "(Yang bersin): Segala puji bagi Allah. (Yang mendengar): Semoga Allah merahmatimu. (Yang bersin membalas): Semoga Allah memberimu petunjuk dan memperbaiki keadaanmu.",
    "kategori": "Adab"
  },
  {
    "id": "41",
    "doa": "Doa Memohon Jodoh",
    "ayat": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ",
    "latin": "Rabbi la tadzarni fardan wa anta khairul waritsin.",
    "artinya": "Ya Tuhanku, janganlah Engkau membiarkan aku hidup seorang diri dan Engkaulah Waris Yang Paling Baik.",
    "kategori": "Pernikahan"
  },
  {
    "id": "42",
    "doa": "Doa Agar Diberi Keturunan",
    "ayat": "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ",
    "latin": "Rabbi hab li min ladunka dzurriyyatan thayyibatan innaka sami'ud-du'a'.",
    "artinya": "Ya Tuhanku, berilah aku dari sisi Engkau seorang anak yang baik. Sesungguhnya Engkau Maha Pendengar doa.",
    "kategori": "Keluarga"
  },
  {
    "id": "43",
    "doa": "Doa Pernikahan (untuk Pengantin)",
    "ayat": "بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
    "latin": "Barakallahu laka wa baraka 'alaika wa jama'a bainakuma fi khairin.",
    "artinya": "Semoga Allah memberkahimu dan memberkahi atasmu serta mengumpulkan kalian berdua dalam kebaikan.",
    "kategori": "Pernikahan"
  },
  {
    "id": "44",
    "doa": "Doa Saat Terlilit Hutang",
    "ayat": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "latin": "Allahummak-fini bihalalika 'an haramik, wa aghnini bifadhlika 'amman siwak.",
    "artinya": "Ya Allah, cukupkanlah aku dengan yang halal dan jauhkanlah aku dari yang haram, dan cukupkanlah aku dengan karunia-Mu dari bergantung pada selain-Mu.",
    "kategori": "Rezeki"
  },
  {
    "id": "45",
    "doa": "Doa Mohon Kemudahan Urusan",
    "ayat": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
    "latin": "Allahumma la sahla illa ma ja'altahu sahla, wa anta taj'alul-hazna idza syi'ta sahla.",
    "artinya": "Ya Allah, tidak ada kemudahan kecuali apa yang Engkau jadikan mudah. Dan Engkau menjadikan kesedihan (kesulitan), jika Engkau kehendaki, menjadi mudah.",
    "kategori": "Kesusahan"
  },
  {
    "id": "46",
    "doa": "Doa Ziarah Kubur",
    "ayat": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ، أَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ",
    "latin": "Assalamu 'alaikum ahlad-diyar minal-mu'minina wal-muslimin, wa inna in sha Allahu bikum lahiqun, as'alullaha lana wa lakumul-'afiyah.",
    "artinya": "Keselamatan atas kalian wahai penghuni kubur dari kaum mukminin dan muslimin. Dan kami insya Allah akan menyusul kalian. Aku memohon kepada Allah bagi kami dan bagi kalian keselamatan.",
    "kategori": "Kematian"
  },
  {
    "id": "47",
    "doa": "Doa Ketika Angin Kencang",
    "ayat": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أُرْسِلَتْ بِهِ",
    "latin": "Allahumma inni as'aluka khairaha wa khaira ma fiha wa khaira ma ursilat bih, wa a'udzu bika min syarriha wa syarri ma fiha wa syarri ma ursilat bih.",
    "artinya": "Ya Allah, sesungguhnya aku memohon kepada-Mu kebaikan angin ini, kebaikan yang ada di dalamnya, dan kebaikan yang Engkau kirim bersamanya. Dan aku berlindung kepada-Mu dari kejahatan angin ini, kejahatan yang ada di dalamnya, dan kejahatan yang Engkau kirim bersamanya.",
    "kategori": "Alam"
  },
  {
    "id": "48",
    "doa": "Doa Ketika Berbuka Puasa (Umum)",
    "ayat": "اللَّهُمَّ لَكَ صُمْتُ وَبِكَ آمَنْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ",
    "latin": "Allahumma laka shumtu wa bika amantu wa 'ala rizqika afthartu.",
    "artinya": "Ya Allah, untuk-Mu aku berpuasa, kepada-Mu aku beriman, dan dengan rezeki-Mu aku berbuka.",
    "kategori": "Puasa"
  },
  {
    "id": "49",
    "doa": "Doa Ketika Berbuka Puasa (Shahih)",
    "ayat": "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ",
    "latin": "Dzahabazh zhoma'u wabtallatil 'uruqu wa tsabatal ajru insya Allah.",
    "artinya": "Telah hilang rasa dahaga, telah basah kerongkongan, dan telah tetap pahala, insya Allah.",
    "kategori": "Puasa"
  },
  {
    "id": "50",
    "doa": "Niat Puasa Ramadhan",
    "ayat": "نَوَيْتُ صَوْمَ غَدٍ عَنْ أَدَاءِ فَرْضِ شَهْرِ رَمَضَانَ هَذِهِ السَّنَةِ لِلَّهِ تَعَالَى",
    "latin": "Nawaitu shauma ghadin 'an adai fardhi syahri Ramadhana hadzihis-sanati lillahi ta'ala.",
    "artinya": "Aku niat berpuasa esok hari untuk menunaikan kewajiban bulan Ramadhan tahun ini karena Allah Ta'ala.",
    "kategori": "Puasa"
  }
]

    